Extensions/УВМ/InformationRegisters/УВМ_Руководители.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УВМ_Руководители</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействуетДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КадровыйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуСписком</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботу</v8:Type>
						<v8:Type>cfg:DocumentRef.УвольнениеСписком</v8:Type>
						<v8:Type>cfg:DocumentRef.КадровыйПеревод</v8:Type>
						<v8:Type>cfg:DocumentRef.КадровыйПереводСписком</v8:Type>
						<v8:Type>cfg:DocumentRef.Увольнение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/УВМ/InformationRegisters/УВМ_ЗначенияКонстант.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УВМ_ЗначенияКонстант</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппировочноеИзмерение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючДополнительный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/УВМ/Catalogs/РабочиеМестаОхраныТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РабочиеМестаОхраныТруда</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Extensions/УВМ/CommonModules/УВМ_ОбщиеДоработки/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

//++dar 31.05.24 (183874)
Функция ПолучитьДатуНачалаУчетаРМ() Экспорт
	ДатаПерехода = Константы.УВМ_ДатаНачалаУчетаРМ.Получить();
	Возврат ?(ЗначениеЗаполнено(ДатаПерехода), ДатаПерехода, Дата('39990101'));
КонецФункции

Функция СоздатьНовоеРабочееМесто(Организация, Подразделение, Должность) Экспорт
	
	ЕстьОшибка = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		ЕстьОшибка = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена организация!");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Подразделение) Тогда
		ЕстьОшибка = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено подразделение!");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Должность) Тогда
		ЕстьОшибка = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена должность!");
	КонецЕсли;
	
	Если ЕстьОшибка Тогда
		Возврат Справочники.РабочиеМестаОхраныТруда.ПустаяСсылка();
	КонецЕсли;
	
	РабочееМестоОбъект = Справочники.РабочиеМестаОхраныТруда.СоздатьЭлемент();
	РабочееМестоОбъект.Владелец = Организация;
	РабочееМестоОбъект.Подразделение = Подразделение;
	РабочееМестоОбъект.Должность = Должность;
	//++dar 05.08.25 (263734)
	//РабочееМестоОбъект.ПорядковыйНомер = ПропущеныйНомерРабочегоМеста();
	РабочееМестоОбъект.ПорядковыйНомер = ПорядковыйНомерРабочегоМестаПоВозрастанию();
	//--dar 05.08.25 (263734)
	РабочееМестоОбъект.Номер = Формат(РабочееМестоОбъект.ПорядковыйНомер, "ЧГ=");
	РабочееМестоОбъект.Наименование = РабочиеМестаОхраныТруда.НаименованиеРабочегоМеста(
		РабочееМестоОбъект.Подразделение,
		РабочееМестоОбъект.Должность, 
		РабочееМестоОбъект.Номер);
	РабочееМестоОбъект.Записать();
	Возврат РабочееМестоОбъект.Ссылка;
КонецФункции

Функция ПропущеныйНомерРабочегоМеста()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	РабочиеМестаОхраныТруда.ПорядковыйНомер КАК ПорядковыйНомер
	|ИЗ
	|	Справочник.РабочиеМестаОхраныТруда КАК РабочиеМестаОхраныТруда
	|ГДЕ
	|	НЕ РабочиеМестаОхраныТруда.ПометкаУдаления
	|	И НЕ РабочиеМестаОхраныТруда.ВАрхиве
	|	И НЕ РабочиеМестаОхраныТруда.ЭтоГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядковыйНомер";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПорядковыйНомерРМ = 1;
	Пока Выборка.Следующий() Цикл
		Если ПорядковыйНомерРМ <> Выборка.ПорядковыйНомер Тогда
			Прервать;
		Иначе
			ПорядковыйНомерРМ = ПорядковыйНомерРМ + 1;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПорядковыйНомерРМ;
	
КонецФункции
//--dar 31.05.24 (183874)

//++dar 05.08.25 (263734)
Функция ПорядковыйНомерРабочегоМестаПоВозрастанию()

	ПорядковыйНомерРМ = 1;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	РабочиеМестаОхраныТруда.ПорядковыйНомер КАК ПорядковыйНомер
	|ИЗ
	|	Справочник.РабочиеМестаОхраныТруда КАК РабочиеМестаОхраныТруда
	|ГДЕ
	|	НЕ РабочиеМестаОхраныТруда.ПометкаУдаления
	|	И НЕ РабочиеМестаОхраныТруда.ВАрхиве
	|	И НЕ РабочиеМестаОхраныТруда.ЭтоГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядковыйНомер УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПорядковыйНомерРМ = Выборка.ПорядковыйНомер + 1;
	КонецЕсли;
	
	Возврат ПорядковыйНомерРМ;
	
КонецФункции
//--dar 05.08.25 (263734)

//++dar 07.05.25 (241010)
Процедура ЗаполнитьВредныеФакторыИзРезультатовСпецоценки(РабочиеМеста) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РабочиеМеста", РабочиеМеста);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВредныеФакторыИВидыРаботРабочегоМеста.РабочееМесто КАК РабочееМесто,
	|	ВредныеФакторыИВидыРаботРабочегоМеста.ВредныйФактор.Код КАК ВредныйФактор
	|ИЗ
	|	РегистрСведений.ВредныеФакторыИВидыРаботРабочегоМеста КАК ВредныеФакторыИВидыРаботРабочегоМеста
	|ГДЕ
	|	ВредныеФакторыИВидыРаботРабочегоМеста.РабочееМесто В(&РабочиеМеста)
	|ИТОГИ ПО
	|	РабочееМесто";
	
	ВыборкаРабочееМесто = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	СвойствоВредныеФакторы = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "ВредныеФакторыИзРезультатовСпецоценки");
	
	ТаблицаСвойствИЗначений = Новый ТаблицаЗначений;
	ТаблицаСвойствИЗначений.Колонки.Добавить("Свойство");
	ТаблицаСвойствИЗначений.Колонки.Добавить("Значение");
	
	РабочиеМестаСФакторами = Новый Массив;
	
	Пока ВыборкаРабочееМесто.Следующий() Цикл
		РабочиеМестаСФакторами.Добавить(ВыборкаРабочееМесто.РабочееМесто);
		Выборка = ВыборкаРабочееМесто.Выбрать();
		КраткийСостав = "";
		Пока Выборка.Следующий() Цикл
			КраткийСостав = КраткийСостав + Выборка.ВредныйФактор + ", ";
		КонецЦикла;
		КраткийСостав = Сред(КраткийСостав, 1, СтрДлина(КраткийСостав) - 2);
		
		ТаблицаСвойствИЗначений.Очистить();
		НовСтр = ТаблицаСвойствИЗначений.Добавить();
		НовСтр.Свойство = СвойствоВредныеФакторы;
		НовСтр.Значение = КраткийСостав;
		УправлениеСвойствами.ЗаписатьСвойстваУОбъекта(ВыборкаРабочееМесто.РабочееМесто, ТаблицаСвойствИЗначений);
	КонецЦикла;
	
	// Очистить доп.реквизиты, если нет вредных факторов
	МсвРабочихМестБезФакторов = ОбщегоНазначенияКлиентСервер.РазностьМассивов(РабочиеМеста, РабочиеМестаСФакторами);
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Свойство",СвойствоВредныеФакторы);
	Для Каждого ВладелецСвойств Из МсвРабочихМестБезФакторов Цикл 
		НачатьТранзакцию();
		Попытка
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(ВладелецСвойств.Метаданные().ПолноеИмя());
			ЭлементБлокировки.УстановитьЗначение("Ссылка", ВладелецСвойств);
			Блокировка.Заблокировать();
			
			ВладелецСвойствОбъект = ВладелецСвойств.ПолучитьОбъект();
			ЗаблокироватьДанныеДляРедактирования(ВладелецСвойствОбъект.Ссылка);
			
			МассивУдаляемыхСтрок = ВладелецСвойствОбъект.ДополнительныеРеквизиты.НайтиСтроки(ПараметрыОтбора);
			Если МассивУдаляемыхСтрок.Количество() > 0 Тогда
				Для Каждого ЭлементМассива из МассивУдаляемыхСтрок Цикл
					ВладелецСвойствОбъект.ДополнительныеРеквизиты.Удалить(ЭлементМассива);
				КонецЦикла;
				
				ВладелецСвойствОбъект.Записать();
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЦикла;

КонецПроцедуры
//--dar 07.05.25 (241010)

//++dar 25.06.25 (255715)
Процедура СформироватьДвиженияПоРуководителям(ТаблицаДвижений) Экспорт
	
	Если ТаблицаДвижений.Количество() > 0 Тогда
		УдалитьДвиженияПоРуководителям(ТаблицаДвижений[0].КадровыйДокумент);	
	КонецЕсли;
	
	Для Каждого СтрокаДвижения Из ТаблицаДвижений Цикл
		МенеджерЗаписи = РегистрыСведений.УВМ_Руководители.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = СтрокаДвижения.Период;
		МенеджерЗаписи.Физлицо = СтрокаДвижения.Физлицо;
		МенеджерЗаписи.Руководитель = СтрокаДвижения.Руководитель;
		МенеджерЗаписи.КадровыйДокумент = СтрокаДвижения.КадровыйДокумент;
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаДвижения, "ДействуетДо") Тогда
			МенеджерЗаписи.ДействуетДо = СтрокаДвижения.ДействуетДо;
		КонецЕсли;
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьДвиженияПоРуководителям(КадровыйДокумент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УВМ_Руководители.Период КАК Период,
	|	УВМ_Руководители.Физлицо КАК Физлицо
	|ИЗ
	|	РегистрСведений.УВМ_Руководители КАК УВМ_Руководители
	|ГДЕ
	|	УВМ_Руководители.КадровыйДокумент = &КадровыйДокумент";
	Запрос.УстановитьПараметр("КадровыйДокумент", КадровыйДокумент);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		НаборЗаписей = РегистрыСведений.УВМ_Руководители.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
		НаборЗаписей.Отбор.Физлицо.Установить(Выборка.Физлицо);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры

Функция ЕстьПодчиненные(Физлицо) Экспорт
	
	РезультатЗапроса = РезультатЗапросаПоРуководителямСотрудников(Физлицо);
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

Функция ПодчиненныеСотрудника(Физлицо) Экспорт
	
	МсвПодчиненных = Новый Массив;
	
	РезультатЗапроса = РезультатЗапросаПоРуководителямСотрудников(Физлицо);
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			МсвПодчиненных.Добавить(Выборка.Физлицо);
		КонецЦикла;
	КонецЕсли;
	
	Возврат МсвПодчиненных;
	
КонецФункции

Функция РуководительСотрудника(Физлицо) Экспорт
	
	Результат = Справочники.ФизическиеЛица.ПустаяСсылка();
	
	РезультатЗапроса = РезультатЗапросаПоРуководителямСотрудников(, Физлицо);
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			Результат = Выборка.Руководитель;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

Функция РезультатЗапросаПоРуководителямСотрудников(Руководитель = Неопределено, Физлицо = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УВМ_Руководители.Период КАК Период,
	|	УВМ_Руководители.Физлицо КАК Физлицо
	|ПОМЕСТИТЬ ВТ_Сотрудники
	|ИЗ
	|	РегистрСведений.УВМ_Руководители КАК УВМ_Руководители
	|ГДЕ
	|	УВМ_Руководители.Период <= &ТекущаяДатаСеанса
	|	И УВМ_Руководители.ДействуетДо = ДАТАВРЕМЯ(1, 1, 1)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УВМ_Руководители.Период,
	|	УВМ_Руководители.Физлицо
	|ИЗ
	|	РегистрСведений.УВМ_Руководители КАК УВМ_Руководители
	|ГДЕ
	|	УВМ_Руководители.Период <= &ТекущаяДатаСеанса
	|	И УВМ_Руководители.ДействуетДо >= &ТекущаяДатаСеанса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТ_Сотрудники.Период) КАК Период,
	|	ВТ_Сотрудники.Физлицо КАК Физлицо
	|ПОМЕСТИТЬ ВТ_АктуальныеСотрудники
	|ИЗ
	|	ВТ_Сотрудники КАК ВТ_Сотрудники
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Сотрудники.Физлицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УВМ_Руководители.Период КАК Период,
	|	УВМ_Руководители.Физлицо КАК Физлицо,
	|	УВМ_Руководители.Руководитель КАК Руководитель,
	|	УВМ_Руководители.ДействуетДо КАК ДействуетДо,
	|	УВМ_Руководители.КадровыйДокумент КАК КадровыйДокумент
	|ИЗ
	|	РегистрСведений.УВМ_Руководители КАК УВМ_Руководители
	|ГДЕ
	|	(УВМ_Руководители.Период, УВМ_Руководители.Физлицо) В
	|			(ВЫБРАТЬ
	|				ВТ_АктуальныеСотрудники.Период КАК Период,
	|				ВТ_АктуальныеСотрудники.Физлицо КАК Физлицо
	|			ИЗ
	|				ВТ_АктуальныеСотрудники КАК ВТ_АктуальныеСотрудники)
	|	И УВМ_Руководители.Руководитель = &Руководитель
	|	И УВМ_Руководители.Физлицо = &Физлицо";	
	
	Запрос.УстановитьПараметр("ТекущаяДатаСеанса", ТекущаяДатаСеанса());
	Если ЗначениеЗаполнено(Руководитель) Тогда
		Запрос.УстановитьПараметр("Руководитель", Руководитель);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "УВМ_Руководители.Руководитель = &Руководитель", "ИСТИНА");
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Физлицо) Тогда
		Запрос.УстановитьПараметр("Физлицо", Физлицо);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "УВМ_Руководители.Физлицо = &Физлицо", "ИСТИНА");
	КонецЕсли;

	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;

КонецФункции 

//++dar 26.01.26 (работа с константами из регистра)

// Получает значение из регистра сведений "Значения констант"
//
// Параметры:
//  <СтруктураОтбора>                      - <Структура>     - набор "ключей" для отбора, значение "Ключ" - обязательное 
//  <ЗначениеПоУмолчанию>                  - <Любое значение>- если результат работы функции Неопределено, функция вернет это значение
//
// Возвращаемое значение:
//   <Значение>      - значение ресурса по заданному ключу, если несколько (возвращается первый) 
//                    - если ключ не найден возвращается "Неопределено" или ЗначениеПоУмолчанию, если оно задано
// Пример вызова:
//		СтруктураОтбора = Новый Структура;
//		СтруктураОтбора.Вставить("Ключ",                    "Тест1");
//		 	
//			Не обязательные отборы:
//		СтруктураОтбора.Вставить("ГруппировочноеИзмерение", "ТестГр1");
//		СтруктураОтбора.Вставить("Организация",           Орг1);
//		СтруктураОтбора.Вставить("КлючДополнительный",        "КлючДоп1");
//
//		УВМ_ОбщиеДоработкиСервер.ЗначениеКонстантыИзРегистра(СтруктураОтбора)
//
Функция ЗначениеКонстантыИзРегистра(СтруктураОтбора, ЗначениеПоУмолчанию = Неопределено) Экспорт
    
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|    УВМ_ЗначенияКонстант.Значение КАК Значение
	|ИЗ
	|    РегистрСведений.УВМ_ЗначенияКонстант КАК УВМ_ЗначенияКонстант
	|ГДЕ
	|    УВМ_ЗначенияКонстант.Ключ = &Ключ";
	
	ДопСтрока = "
	|    И УВМ_ЗначенияКонстант.Замена = &Замена";
	
	
	Для каждого ЭлементКоллекции Из СтруктураОтбора Цикл
		
		тКлюч = ЭлементКоллекции.Ключ;
		
		Запрос.УстановитьПараметр(тКлюч, ЭлементКоллекции.Значение);
		
		Если тКлюч <> "Ключ" Тогда 
			
			ТекстЗапроса = ТекстЗапроса + СтрЗаменить(ДопСтрока,"Замена",тКлюч);
			
		КонецЕсли;    
		
	КонецЦикла;
	
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = ЗначениеПоУмолчанию;
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Значение;
	КонецЕсли;
	
	Возврат Результат;
    
КонецФункции

// Получает массив значений из регистра сведений "Значения констант" 
//
// Параметры:
//  <СтруктураОтбора>                      - <Структура>     - набор "ключей" для отбора, значение "Ключ" - обязательное 
//  <ЗначениеПоУмолчанию>                  - <Любое значение>- если результат работы функции Неопределено, функция вернет это значение
//
// Возвращаемое значение:
//   <Значение>      - <Массив>	-значение ресурсов по заданному ключу 
//                    - если ключ не найден возвращается "Неопределено" или ЗначениеПоУмолчанию, если оно задано
// Пример вызова:
//		СтруктураОтбора = Новый Структура;
//		СтруктураОтбора.Вставить("Ключ",                    "Тест1");
//		 	
//			Не обязательные отборы:
//		СтруктураОтбора.Вставить("ГруппировочноеИзмерение", "ТестГр1");
//		СтруктураОтбора.Вставить("Организация",           Орг1);
//		СтруктураОтбора.Вставить("КлючДополнительный",        "КлючДоп1");
//
//		УВМ_ОбщиеДоработкиСервер.ЗначениеКонстантыИзРегистра(СтруктураОтбора)
//
Функция ЗначенияКонстантИзРегистраМассивом(СтруктураОтбора, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|    УВМ_ЗначенияКонстант.Значение КАК Значение
	|ИЗ
	|    РегистрСведений.УВМ_ЗначенияКонстант КАК УВМ_ЗначенияКонстант
	|ГДЕ
	|    УВМ_ЗначенияКонстант.Ключ = &Ключ";
	
	ДопСтрока = "
	|    И УВМ_ЗначенияКонстант.Замена = &Замена";
	
	
	Для каждого ЭлементКоллекции Из СтруктураОтбора Цикл
		
		тКлюч = ЭлементКоллекции.Ключ;
		
		Запрос.УстановитьПараметр(тКлюч, ЭлементКоллекции.Значение);
		
		Если тКлюч <> "Ключ" Тогда 
			
			ТекстЗапроса = ТекстЗапроса + СтрЗаменить(ДопСтрока,"Замена",тКлюч);
			
		КонецЕсли;    
		
	КонецЦикла;
	
	Запрос.Текст = ТекстЗапроса;
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	
	Результат = ЗначениеПоУмолчанию;
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Значение");
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Результат;
    
	
КонецФункции

Функция ЗаписиКонстантВРегистре(СтруктураОтбора) Экспорт
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|  *
	|ИЗ
	|  РегистрСведений.УВМ_ЗначенияКонстант КАК УВМ_ЗначенияКонстант
	|ГДЕ
	|    УВМ_ЗначенияКонстант.Ключ = &Ключ";
	ДопСтрока = "
	|    И УВМ_ЗначенияКонстант.Замена = &Замена";

	Для каждого ЭлементКоллекции Из СтруктураОтбора Цикл
		тКлюч = ЭлементКоллекции.Ключ;
		Запрос.УстановитьПараметр(тКлюч, ЭлементКоллекции.Значение);
		Если тКлюч <> "Ключ" Тогда 
			ТекстЗапроса = ТекстЗапроса + СтрЗаменить(ДопСтрока,"Замена",тКлюч);
		КонецЕсли;
	КонецЦикла;
	Запрос.Текст = ТекстЗапроса;
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Процедура УстановитьЗначениеКонстантыВРегистре(СтруктураИзмерений, ЗначениеКонстанты, Замещать=Истина) Экспорт
	
	Если не ЗначениеЗаполнено(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураИзмерений,"Ключ",Неопределено)) тогда
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.УВМ_ЗначенияКонстант.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Ключ 					= СтруктураИзмерений.Ключ;
	МенеджерЗаписи.ГруппировочноеИзмерение 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураИзмерений,"ГруппировочноеИзмерение","");
	МенеджерЗаписи.Организация 				= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураИзмерений,"Организация",Справочники.Организации.ПустаяСсылка());
	МенеджерЗаписи.КлючДополнительный 		= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураИзмерений,"КлючДополнительный","");
	МенеджерЗаписи.Значение 				= ЗначениеКонстанты;	
	МенеджерЗаписи.Записать(Замещать);
		
КонецПроцедуры

Процедура ОчиститьЗаписиКонстантВРегистре(СтруктураОтбора) Экспорт
	Если не СтруктураОтбора.Свойство("Ключ") тогда
		Возврат;
	КонецЕсли;
	НаборЗаписей = РегистрыСведений.УВМ_ЗначенияКонстант.СоздатьНаборЗаписей();
	Для Каждого  ЭлементКоллекции Из СтруктураОтбора Цикл
		НаборЗаписей.Отбор[ЭлементКоллекции.Ключ].Установить(ЭлементКоллекции.Значение,Истина);
	КонецЦикла;
	НаборЗаписей.Записать(Истина);
КонецПроцедуры
//--dar 26.01.26 (работа с константами из регистра)

#КонецОбласти
//--dar 25.06.25 (255715)

//++dar 25.06.25 (255715)
Функция ПолучитьДатуНачалаУчетаРуководителей() Экспорт
	ДатаПерехода = Константы.УВМ_ДатаНачалаУчетаРуководителей.Получить();
	Возврат ?(ЗначениеЗаполнено(ДатаПерехода), ДатаПерехода, Дата('39990101'));
КонецФункции
//--dar 25.06.25 (255715)
